app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

  def create
    file = params[:tweet][:file].read
    @tweet = Tweet.new(message: params[:tweet][:message], file: file, tdate: Time.current)
    if @tweet.save
---
INSERT INTO "tweets" ("message", "tdate", "created_at", "updated_at", "file") VALUES (?, ?, ?, ?, ?)  [["message", "a"], ["tdate", "2023-10-16 15:42:53.533595"], ["created_at", "2023-10-16 15:42:53.534214"], ["updated_at", "2023-10-16 15:42:53.534214"], ["file", "<74215 bytes of binary data>"]]

  def show
    @tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def edit
    @tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 2]]

  def get_image
    image = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]